Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/functions_of_the_seanad.html.txt.tmx
Source language: en
Languages: ga

source: The main function of Seanad Éireann is in relation to legislation
ga: Baineann príomhfheidhm Sheanad Éireann le reachtaíocht

source: A Bill may start life in either the Dáil or the Seanad
ga: Is féidir Bille a thabhairt chun tosaigh sa Dáil nó sa Seanad

source: In practice, the vast majority of Bills originate from the Government and are passed by the Dáil first
ga: Go hiondúil, is ón Rialtas a thagann tromlach na mBillí agus déantar iad a rith ar dtús sa Dáil

source: They are then sent to the Seanad for debate and consideration
ga: Cuirtear ansin iad chuig an Seanad le díospóireacht agus moltaí

source: Within 90 days, the Seanad may propose amendments, reject or pass a Bill
ga: Taobh istigh de 90 lá is féidir leis an Seanad leasuithe a mholadh, Bille a dhiúltú nó a rith

source: The Dáil has the power to over-ride the Seanad's rejection of a Bill
ga: Tá cumhacht ag an Dáil diúltú an tSeanaid do Bhille a shárú

source: The Seanad's powers in relation to Bills for Government spending (Money Bills) are very restricted
ga: Tá cumhachtaí an tSeanaid maidir le Billí a bhaineann le caiteachas an Rialtais (Billí Airgid) fíor theoranta

source: These Bills cannot start life in the Seanad, they must come from the Dáil
ga: Ní féidir tús a chur le Billí mar seo sa Seanad, ní mór dóibh teacht ón Dáil

source: The Seanad has only 21 days to consider a Money Bill and cannot make amendments to it
ga: Tá 21 lá ag an Seanad Bille Airgid a phlé agus ní féidir leis leasuithe a dhéanamh air

source: The Seanad has other functions, which it shares with the Dáil, such as the removal from office of the President or a judge of the Supreme Court, declaring a state of emergency and annulling statutory instruments
ga: Tá feidhmeanna eile ag an Seanad, a roinníonn sé leis an Dáil, mar shampla Uachtarán a chur as oifig nó breitheamh den Chúirt Uachtarach, staid phráinne a ghairm agusionstraim reachtúla a chur ar neamhní

source: In recent years, parliamentary committees have become an important part of the work of the Seanad
ga: Le blianta beaga anuas is cuid tábhachtach de obair an tSeanaid an pháirt a ghlacann siad i gcoistí parlaiminte

source: Joint Committees involve both Seanad and Dáil members sitting and voting together on particular issues
ga: Bíonn comhaltaí ón Seanad agus ón Dáil páirteach i gcomhchoistí ag suí lena chéile agus ag caitheamh vótaí le chéile ar cheisteanna faoi leith

source: Seanad Éireann normally meets on Wednesdays and Thursdays
ga: Maidin Dé Céadaoin agus Déardaoin a thagann Seanad Éireann le chéile go hiondúil

source: Senators are also involved in drafting amendments to Bills and examining proposals for new legislation
ga: Tá baint ag Seanadóirí freisin le leasuithe do Bhillí a dhreachtú agus moltaí maidir le reachtaíocht nua a scrúdú

source: They contribute to debates on Bills and other important matters
ga: Bíonn siad páirteach i ndíospóireachtaí ar Bhillí agus ar cheisteanna tábhachtacha eile

source: They vote on issues in the House
ga: Caitheann siad vótaí ar cheisteanna sa Teach

source: Senators are not officially separated into political parties
ga: Níl na Seanadóirí roinnte i bpáirtithe polaitiúla go hoifigiúil

source: However, they usually divide into groups supporting and opposing Government business when voting on issues
ga: Ach, is iondúil go roinníonn siad iad féin i ngrúpaí a thugann tacaíocht do Ghnó an Rialtais nó don fhreasúra nuair atá vóta le caitheamh

source: Senators have certain privileges as members of the Oireachtas
ga: Tá pribhléidí faoi leith ag Seanadóirí mar bhaill den Oireachtas

source: They may be disciplined by the House for breach of procedure or abuse of privilege
ga: Is féidir leis an Teach iad a smachtú má sháraíonn siad na rialacha nó má bhaineann siad mí-úsáid as pribhléidí
